<?php
return [
    'is_show' => [
        '0' => '隐藏',
        '1' => '显示',
    ],
    'is_use' => [
        '0' => '卸载',
        '1' => '安装',
    ],
    'is_jump' => [
        '0' => '否',
        '1' => '是',
    ],
    'jump_type' => [
        '1' => '本程序',
        '2' => '其他程序'
    ],
    'oil_type' => [
        '1' => '5#',
        '2' => '0#',
        '3' => '-10#',
        '4' => '-20#',
        '5' => '-35#',
        '6' => '-50#',
        '7' => '10#',
        '8' => '20#',
        '9' => '30#',
        '10' => '液化天然气'
    ],
    'oil_source' => [
        '1' => '中石化',
        '2' => '中石油',
        '3' => '无',
    ],
    'site_type' => [
        '0' => '未知',
        '1' => '油站',
        '2' => '气站',
    ],
    'user_status' => [
        '-2'=>'黑名单',
        '-1'=>'冻结',
        '0'=>'限制登陆',
        '1'=>'正常',
    ],
    'waiter_status' => [
        '-2'=>'黑名单',
        '-1'=>'冻结',
        '0'=>'限制登陆',
        '1'=>'正常',
    ],
    'waiter_grade' => [
        '1'=>'员工',
        '2'=>'管理',
    ],
    'gun_num' => [
        '1' => '1号枪',
        '2' => '2号枪',
        '3' => '3号枪',
        '4' => '4号枪',
        '5' => '5号枪',
        '6' => '6号枪',
        '7' => '7号枪',
        '8' => '8号枪',
        '9' => '9号枪',
    ],
    'settlement' => [
        '1' => '体积',
        '2' => '价格',
    ],
    'pay_price' => [
    ],
    'pay_type' => [
        '0' => '未支付',
        '1' => '微信支付',
        '2' => '账户支付',
        '3' => '现金支付',
        '4' => '微信支付',
        '5' => '微信支付'
    ],
    //后台使用站点支付配置
    'admin_pay_type' => [
        '4' => '收钱吧',
        '5' => '汇聚支付'
    ],
    'admin_pay_type_icon' => [
        '4' => 'sqb.png',
        '5' => 'joinpay.png'
    ],
    'payway' => [
        '2' => '支付宝',
        '3' => '微信',
        '17' => '银联云闪付',
        '18' => '翼支付',
        '19' => 'Weixin-Local',
        '22' => '索迪斯预付卡',
        '100' => '储值支付',
        '101' => '礼品卡',
    ],
    'sub_payway' => [
        '1' => '条码支付',
        '2' => '二维码支付',
        '3' => 'wap支付',
        '4' => '小程序支付',
        '5' => 'APP支付',
        '6' => 'H5支付',
    ],
    'xcx_order_status' => [
        '1' => '待支付',
        '2' => '已支付',
        '3' => '已完成',
    ],
    'order_status' => [
        '1' => '未付款',
        '2' => '已付款',
        '3' => '已完成',
        '4' => '状态异常',
        '5' => '申请取消',
        '6' => '取消失败',
        '7' => '取消成功',
        '8' => '已关闭',
        '9' => '已退款'
    ],
    'app_order_status' => [
        '1' => '未付款',
        '2' => '待确认',
        '3' => '交易完成',
        '4' => '订单异常',
        '5' => '交易已取消',
    ],
    'invoice_type' => [
        '1' => '个人',
        '2' => '公司'
    ],
    'invoice_status' => [
        '1' => '提交申请',
        '2' => '已开发票'
    ],
    'unit_name' => [
        '0' => '元/公斤',
        '1' => '元/升'
    ],
    'is_cut_balance' => [
        '0' => '不扣除',
        '1' => '扣除'
    ],
    'is_push_g7' => [
        '0' => '不推送',
        '1' => '推送'
    ],
    'lard_recharge_discount' => env('LARD_RECHARGE_DISCOUNT',1.12),  //万金油充值优惠比例
    
    'join_pay' => [
        'MerchantNo' => '888111300003898',  //商户编号
        'secret'     => 'cf4abdba77e0419fb82969ab47f9b374',  //密钥
    ],
];
